#include <iostream> // підключення бібліотеки для введення та виведення даних
#include <cmath> // підключення бібліотеки математичних операцій для кубічного кореня

using namespace std; // використання стандартного простору імен, щоб не писати std::

int main() // головна функція програми, з якої починається виконання
{
    double x; // оголошення змінної x дійсного типу для вхідного числа
    cout << "Введіть число X: "; // виведення підказки для користувача на екран
    cin >> x; // зчитування введеного числа з клавіатури у змінну x
    
    double cube; // оголошення змінної для збереження результату піднесення до куба
    cube = x * x * x; // обчислення куба числа

    double cube_root; // оголошення змінної для збереження кубічного кореня
    cube_root = cbrt(x); // обчислення кубічного кореня

    cout << "Куб числа x = " << cube << endl; // виведення результату обчислення куба
    cout << "Кубичний корінь з чиссла X = " << cube_root << endl; // виведення результату кубічного кореня

    return 0; // завершення програми 
}